{
  "META": {
    "slideshow_title": "Keeping Faith: Healing after the mass shooting at First Baptist Church of Sutherland Springs",
    "slideshow_date": "Dec 31st, 2018",
    "slideshow_photographer": "Lisa Krantz",
    "slideshow_hero_img": "//s.hdnux.com/photos/77/57/34/16709403/3/3000x3000.jpg",
    "slideshow_url_for_social": "https://www.expressnews.com/sutherland-springs-keeping-faith-2018"
  },
  "PHOTOS": [
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709403/3/3000x3000.jpg",
      "caption": "Kris Workman, with his wife, Colbey Workman, and friend Benny Ramirez, visits the memorial inside First Baptist Church in Sutherland Springs on Sunday, Dec. 17, 2017. The visit was Kris' first time back at the church since he was shot and paralyzed there Nov. 5."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709400/3/3000x3000.jpg",
      "caption": "Marina Pomeroy, the sister of Annabelle Pomeroy, comforts their mother, Sherri Pomeroy, as they visit Annabelle's grave on August 5 in Sutherland Springs. Annabelle was killed at the age of 14 in the church."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709404/3/3000x3000.jpg",
      "caption": "Rod Green walks with his granddaughter, who was visiting from Colorado, as they visit the church on May 28, 2018. Green and his wife, Judy, are long time members and run the church's food pantry that serves the community every Friday morning."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709401/3/3000x3000.jpg",
      "caption": "Elliott Jordan, 4, center, dances as the praise team sings during a Sunday service at First Baptist Church of Sutherland Springs on Sunday, April 29, 2018. Renderings of the new church hang on the wall behind them."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709402/3/3000x3000.jpg",
      "caption": "Kris Workman, right, who was shot in the back and paralyzed, shows one of his scars to fellow survivor, David Colbath, left, who was shot 8 times, after church on Feb. 11. Workman has gained slight movement in his legs. Watching are fellow survivor and Kris' sister-in-law, Morgan Workman, from left, friend Jaydon Montgomery, Morgan's father Darrell Harris, and Kris' daughter, Eevee Workman, 3."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709405/3/3000x3000.jpg",
      "caption": "Gunny Macias and his wife, Jennifer Macias, are greeted during church on April 11. For months, Gunny sat during the meet and greet part of the service and members and guests came to him."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709406/3/3000x3000.jpg",
      "caption": "Bride Morgan Harris, left, reaches out for her nephew, Jacob Pomeroy, 7, as he gets his hair sprayed by his mother and Morgan's sister, Chelsi Pomeroy, as they get ready for Morgan's wedding at Spinelli's in Comfort on Thursday, Jan. 11, 2017. At right, Morgan's sister, Colbey Workman, gets her dress adjusted by Morgan's friend and wedding coordinator, Shelby Griffin."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709407/3/3000x3000.jpg",
      "caption": "Morgan Workman and Kyle Workman walk towards their guests after being married by Pastor Frank Pomeroy at Spinelli's in Comfort on Thursday, Jan. 11, 2017."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709408/3/3000x3000.jpg",
      "caption": "Kris Workman waits for group photos after the wedding ceremony for his brother, Kyle Workman, and Morgan Workman at Spinelli's in Comfort on Thursday, Jan. 11, 2017. Beside him are photos memorializing the people who were invited to the wedding but were killed in the shooting at the Workman's church, First Baptist Church of Sutherland Springs."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709409/3/3000x3000.jpg",
      "caption": "Kris Workman and his wife, Colbey Workman, laugh as she sits on his lap mid dance during the reception after the wedding of Colbey's sister, Morgan Workman, to Kris' brother, Kyle Workman, at Spinelli's in Comfort on Thursday, Jan. 11, 2017."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709410/3/3000x3000.jpg",
      "caption": "Pam Hollingworth raises her arms as she comes out of the water after being baptized by Pastor Frank Pomeroy, left, during a Sunday service at First Baptist Church of Sutherland Springs on March 18, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709411/3/3000x3000.jpg",
      "caption": "Evelyn Hill, 8, prays from the shoulders of her father, John Holcombe, during the Easter service at First Baptist Church of Sutherland Springs on April 1, 2018. John records every service and posts the videos on YouTube weekly."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709412/3/3000x3000.jpg",
      "caption": "Sherri Pomeroy prays, along with many others, along the fence perimeter of the church during the prayer walk which was part of First Baptist Church of Sutherland Springs' Groundbreaking Celebration on Saturday, May 5, 2018. Holcombe and 8 family members were killed in the shooting at the church."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709413/3/3000x3000.jpg",
      "caption": "John Holcombe, with his children, Evelyn Hill, 8, and Philip Hill, 16, waters flowers and an olive tree they planted for their nine family members buried together in Sutherland Springs on June 16, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709414/3/3000x3000.jpg",
      "caption": "John Holcombe, with his children, Evelyn Hill, 8, and Philip Hill, 16, sit after watering flowers and an olive tree they planted for their nine family members buried together in Sutherland Springs on June 16, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709417/3/3000x3000.jpg",
      "caption": "Sheila Arms, center, embraces Colbey Workman, left, and Sarah Slavin, right, with Sarah's daughter, Elene Slavin, during the pancake breakfast prepared by the men after the Easter sunrise service at First Baptist Church of Sutherland Springs on April 1, 2018. Workman's husband was shot and paralyzed while Sarah, a Holcombe, lost 9 family members in the mass shooting Nov. 5."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709415/3/3000x3000.jpg",
      "caption": "Evelyn Hill combs the hair of her father, John Holcombe, before chuch on Oct. 21, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709416/3/3000x3000.jpg",
      "caption": "Evelyn Hill, 8, stands next to a door John Holcombe has kept with height markings of her slain siblings and her brother, Philip, in a room that is being renovated at their home on Oct. 28, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709418/3/3000x3000.jpg",
      "caption": "Colbey Workman, with her daughter, Eevee Workman, 3, from left, Colbey's sister, Morgan Workman, and Colbey's husband, Kris Workman, sing during a Sunday service at First Baptist Church of Sutherland Springs on July 1, 2018. Morgan's husband is Kyle Workman, Kris' brother. Morgan, Kyle and Kris all surived the shooting."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709420/3/3000x3000.jpg",
      "caption": "John Holcombe supports his daughter, Evelyn Hill, at she jumps during the Sunday service at First Baptist Church of Sutherland Springs on April 15, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709419/3/3000x3000.jpg",
      "caption": "First Baptist Church of Sutherland Springs pastor Frank Pomeroy leads a riflery class during R.A. Camp at Alto Frio Baptist Encampment in Leakey on June 27, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709423/3/3000x3000.jpg",
      "caption": "Kandi Pomeroy dances with her son, Joel Rieger III, during a fish fry held for First Baptist Church of Sutherland Springs members and the community, on August 25, 2018. Kandi is the daughter of pastor Frank Pomeroy and Sherri Pomeroy."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709421/3/3000x3000.jpg",
      "caption": "Jaime Correa instructs Julie Dahlberg, a member of First Baptist Church of Sutherland Springs' newly formed safety response team, at LoneStar Handgun in Converse on June 30, 2018. Also participating in the \"Principles of Active Shooter\" class are other members of the team including Julie's husband, Shane Dahlberg, from left, Evan Bonesteel and pastor Frank Pomeroy."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709422/3/3000x3000.jpg",
      "caption": "Kathleen Curnow and her husband, Fred Curnow, celebrate seeing the completion of the fence built around her house by youth missionaries from East Saugatuck Church of Holland, Michigan as the Curnows arrive home from work on July 26, 2018. The Curnows witnessed the massacre take place at the church across from their house and Kathleen has suffered from PTSD since."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709424/3/3000x3000.jpg",
      "caption": "Danielle Kelley, the widow of gunman Devin Kelley, talks about him and their relationship at her home in Cibolo on July 10, 2018. Kelley returned to the church on Father's Day for the first time since the shooting."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709425/3/3000x3000.jpg",
      "caption": "Michelle Shields kisses the urn holding the ashes of her mother, Lula White, before spreading them into the Gulf of Mexico from a jetty in Port Aransas on what would have been Lula's birthday, July 2, 2018. Frank Pomeroy, center, and Michelle's husband, Ben Shields, stand by before Frank led the group of family and friends in prayer."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709427/3/3000x3000.jpg",
      "caption": "Sherri Kay and Michelle Shields relax in the waves of the Gulf of Mexico after spreading the ashes of Michelle's mother, Lula White, off a jetty in Port Aransas on what would have been Lula's birthday, July 2, 2018. Sherri, a counselor with the Ecumenical Center which has provided counseling to many survivors, also lost her nephew, Bob Corrigan, and his wife, Shani, in the shooting at their church."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709426/3/3000x3000.jpg",
      "caption": "Michelle Shields kisses her daughter, Danielle Kelley, on August 6, 2018 at Michelle's home in Sutherland Springs. Danielle is the widow of the gunman who killed Shields' mother and 25 other parishioners at the church Danielle grew up in."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709428/3/3000x3000.jpg",
      "caption": "Gunny Macias, with his wife, Jennifer, recounts moments from inside the church when he was shot multiple times. \"There was a teenager girl... she cried out to me, and she said, \"Gunny, I'm scared.\" I remember telling her, \"Don't be scared. Let's sing a song... She was about two pews back, and we were singing Jesus Loves Me, and I blacked out.\""
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709429/3/3000x3000.jpg",
      "caption": "Survivor Maggie Vidal navigates her home for the first time ina wheelchair with help from her daughter-in-law, Teri Vidal, on her first day at home since the Nov. 5 shooting, after leaving the rehabilition center where she was living earlier in the day on Feb. 10, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709430/3/3000x3000.jpg",
      "caption": "After more than three months in the hospital and rehab, shooting survivor Maggie Vidal watches televsion with her grandson, Randy Vidal Jr., 2, on the first afternoon in her home after leaving the rehabilition center earlier in the day on Feb. 10, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709431/3/3000x3000.jpg",
      "caption": "Sandy Ward keeps watch over her grandson, Ryland Ward, and her daughter, Haley Ward, during the service on April 22, 2018. Behind them are Kris Workman and his wife, Colbey. Both Kris and Ryland were critically injured in the shooting."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709432/3/3000x3000.jpg",
      "caption": "Ryland Ward has the strength of his hand tested with Occupational Therapist Rudy Cardenas and student Katherine Garcia during occupational therapy at Children's Rehabilitation Institute TeletonUSA in San Antonio on Nov. 1, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709433/3/3000x3000.jpg",
      "caption": "Ryland Ward entertains himself as Dr. Cynthia Riley talks with his father after Ryland's occupational therapy appointment at Children's Rehabilitation Institute TeletonUSA in San Antonio on Nov. 1, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709434/3/3000x3000.jpg",
      "caption": "Sherri Pomeroy sorts through boxes of unclaimed belongings that were taken from the church by law enforcement for the investigation after the shooting and returned to Sherri on June 26. The boxes were returned to Sherri from the 81'st Judicial District Attorney's Office. Sherri cared about getting one item back that day, the cell phone belonging to her slain daughter, Annabelle."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709435/3/3000x3000.jpg",
      "caption": "Sherri Pomeroy looks through the phone belonging to her daughter, Annabelle, for the first time since Annabelle was killed in the shooting at their church. The phone was in boxes of unclaimed belongings that were taken from the church. After sorting through the boxes, Sherri plugged in Annabelle's phone, hoping to see new photos of and by Annabelle from before the shooting."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709437/3/3000x3000.jpg",
      "caption": "Pastor Frank Pomeroy comforts his wife, Sherri Pomeroy, before heading to the pulpit to deliver his sermon on Sunday, Oct. 21, 2018, on what would have been the 15th birthday for their daughter, Annabelle, who was shot and killed last year at their church. Their grandson, Lee Pomeroy, right. also provides comfort for Sherri during the service."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709438/3/3000x3000.jpg",
      "caption": "Charlene Uhl decorates the memorial cross dedicated to her daughter, Haley Krueger, who was 16-years-old when she was killed at the church, as the new First Baptist Church of Sutherland Springs is built by the North American Mission Board on Sept. 18. Uhl has continued to decorate the cross almost every week since the shooting and struggles with grief daily."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709436/3/3000x3000.jpg",
      "caption": "Mikayla Valdez, 5, plays at the table honoring Haley Krueger on July 2, what would have been Haley's 17th birthday. Valdez, whose family lives with Haley's, joined over 100 family and friends to celebrate Haley's life in the fellowship hall at First Baptist Church of Sutherland Springs."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709441/3/3000x3000.jpg",
      "caption": "Prosthetist/Orthotist Jesse Rettele fits Kris Workman with custom orthotics while Workman's wife, Colbey, watches and their daughter, Eevee, entertains herself, at The University of Texas Health Science Center on October 26, 2018. The orthotics will help Kris, who was paralyzed in the shooting, stand and eventually walk."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709442/3/3000x3000.jpg",
      "caption": "Colbey Workman kisses her husband, Kris Workman, with their daughter, Eevee, goodbye after watching him stand and walk with the support of custom orthotics and bars with his Prosthetist/Orthotist Jesse Rettele at The University of Texas Health Science Center on October 26, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709443/3/3000x3000.jpg",
      "caption": "Kris Workman stands using his new custom made orthotics with the assistance of physical therapist Selina Morgan, left, and Michael Nash, a UT Health San Antonio doctorate of physical therapy student at the Medical Arts and Reseach Center (MARC) with UT Health San Antonio on Oct. 26, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/34/16709439/3/3000x3000.jpg",
      "caption": "Kris Workman puts shoes on his daughter, Eevee, at their home in Adkins on August 26, 2018. In October, Kris received an accessible van he could drive, regaining his independence."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709440/3/3000x3000.jpg",
      "caption": "A bullet wound on David Colbath's right arm is evidence of why he is learning to shoot a gun with his left hand, instead of his dominant hand, in the Firearms Training Simulator at the Center for the Intrepid at Brooke Army Medical Center on Friday, March 9, 2018. Colbath was shot 8 times at his church and underwent several months of therapy at the Center for the Intrepid."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709445/3/3000x3000.jpg",
      "caption": "Sherri Pomeroy is embraced by her daugher-in-law, Chelsi Pomeroy, left, and her daughter, Kandi Pomeroy, right, as Sherri holds a balloon to release in honor of what would have been the 15th birthday for her slain daughter, Annabelle Pomeroy, on Sunday, Oct. 21 in Sutherland Springs. At left is Annabelle's father, Frank Pomeroy."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709444/3/3000x3000.jpg",
      "caption": "Kaleb Pomeroy carries balloons to be released at the gravesite of his sister, Annabelle Pomeroy, on what would have been Annabelle's 15th birthday, in Sutherland Springs on Oct. 21, 2018. At right, their mother, Sherri Pomeroy, embraces Kaleb's daughter, Amanda, 10."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709446/3/3000x3000.jpg",
      "caption": "Zoe Zavala, 7, walks around the Polley Mansion after being crowned Honorary Little Miss during the 30th Annual Sutherland Springs Old Town Days Royal Court Presentation Ceremony on Sunday, Oct. 21, 2018 in Sutherland Springs. Zavala and her grandmother, Debbie Braden were both shot in their church and underwent extensive surgeries and rehabilitation while Debbie lost her husband and Zoe's grandfather, Keith Braden."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709447/3/3000x3000.jpg",
      "caption": "First Baptist Church of Sutherland Springs shooting survivors Zoe Zavala, 7, center, named Honorary Little Miss, and Rihanna Tristan,10, (behind Zoe) named Honorary Princess, pose for photos after the 30th Annual Sutherland Springs Old Town Days Royal Court Presentation Ceremony during a dinner at the Sutherland Springs Community Center on Sunday, Oct. 21."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709448/3/3000x3000.jpg",
      "caption": "Zoe Zavala, 7, right, one of the youngest survivors, swings with a friend after Zavala was named Honorary Little Miss during the 30th Annual Sutherland Springs Old Town Days Royal Court Presentation Ceremony at the Polley Mansion in Sutherland Springs on Oct. 21, 2018. Zavala was shot in the hip and underwent extensive surgeries and her grandmother, Debbie Braden, was shot four times while Debbie's husband of 33 years, Keith Braden, was killed."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709449/3/3000x3000.jpg",
      "caption": "Haley Ward, 8, looks at the chairs dedicated to her family members in the memorial during Remembering Sutherland Springs: One Year Later at First Baptist Church of Sutherland Springs on Sunday, Nov. 4, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709450/3/3000x3000.jpg",
      "caption": "Naomi Deatherage cleans the headstone of Crystal Holcome, after her father, James Deatherage, left, engraved the names of her children on it at Carter Memorials in Segin on November 2, 2018. Crystal's two living children, Philip Hill and Evelyn Hill, picked out and designed the headstones for their mother and her unborn child and their three siblings who were killed at the church Nov. 5."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709458/3/3000x3000.jpg",
      "caption": "Gail Uhlig, the aunt of the Hill children, is comforted by James Deatherage, co-owner of Carter Memorials, upon seeing the headstones for Crystal Holcombe, her unborn child, and her three childen, Megan, Greg and Emily Hill, after Deatherage delievered them to the Sutherland Springs cemetery on Nov. 2. Uhilg, a funeral director, handled funerals for 19 of the victims after the shooting."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709451/3/3000x3000.jpg",
      "caption": "Pastor Frank Pomeroy and his wife, Sherri, pause after writing messages for their daughter, Annabelle, including Frank's message, left, during a private event for survivors, their immediate families and the families of victims to write for themselves and those they lost on the walls of the new First Baptist Church of Sutherland Springs under construction on Nov. 5, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709452/3/3000x3000.jpg",
      "caption": "Mallory Yarbrough, Evelyn Hill, and Reina Holcombe play outside next to the new First Baptist Church of Sutherland Springs being built by the North American Mission Board, on Oct. 21, 2018. Evelyn and Reina lost 9 family members at the church last November."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709456/3/3000x3000.jpg",
      "caption": "Evelyn Hill, 8, rides on the shoulders of her father, John Holcombe, as they laugh with Windy Choate, left, after the caroling hayride around Sutherland Springs on Dec. 16."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709453/3/3000x3000.jpg",
      "caption": "Members of First Baptist Church of Sutherland Springs and friends including Kris Workman, left, his wife, Colbey Workman, far right, and Amanda Pomeroy, sing during the church's Christmas caroling hayride around Sutherland Springs on Dec. 16, 2018."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709457/3/3000x3000.jpg",
      "caption": "Miles Groff holds his five-month-old daughter, Willow, during First Baptist Church of Sutherland Springs' Christmas potluck on Dec. 9."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709454/3/3000x3000.jpg",
      "caption": "Elene Slavin, 3, plays outside during First Baptist Church of Sutherland Spring's Christmas potluck next to the construction of their new church, on Dec. 9."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709455/3/3000x3000.jpg",
      "caption": "Pam Hollingworth embraces pastor Frank Pomeroy after he became emotional several times during his sermon on Dec. 23. At left is his wife, Sherri, and their daughter, Marina. Hollingworth joined the church after the shooting and was baptized in March."
    },
    {
      "url": "//s.hdnux.com/photos/77/57/35/16709459/3/3000x3000.jpg",
      "caption": "Chesni Winter watches pastor Frank Pomeroy begin the Christmas Eve candlelight service at First Baptist Church of Sutherland Springs."
    }
  ]
}